IDEA StatiCa Open Model
BendData Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The BendData type exposes the following members.
Properties
Name | Description
EndFaceNormal1
 End Face Normal vector
Plate1Id
 First plate
Plate2Id
 Second plate
Point1OfSideBoundary1
 Side boundary first plate point 1
Point1OfSideBoundary2
 Side boundary second plate point 1
Point2OfSideBoundary1
 Side boundary first plate point 2
Point2OfSideBoundary2
 Side boundary second plate point 2
Radius
 Radius of bend
Top
See Also
Reference
BendData Class
IdeaRS.OpenModel.Connection Namespace